## 파이썬에서 텍스트 파일과 엑셀 파일 읽기 - pandas

In [1]:
import pandas as pd

In [2]:
CCTV_Seoul = pd.read_csv('./CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [3]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [4]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [5]:
pop_Seoul = pd.read_excel('./population_in_Seoul.xls', 
                          header=2,
                          usecols='B,D,G,J,N',
                          encoding='utf-8')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [6]:
pop_Seoul.rename(columns={pop_Seoul.columns[0]: '구별',
                         pop_Seoul.columns[1]: '인구수',
                         pop_Seoul.columns[2]: '한국인',
                         pop_Seoul.columns[3]: '외국인',
                         pop_Seoul.columns[4]: '고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

## pandas 기초 익히기

In [7]:
import pandas as pd
import numpy as np

In [8]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [9]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01  0.510523 -1.035007 -0.740734 -0.392614
2013-01-02 -0.762233  1.403230  0.726063  0.897071
2013-01-03 -0.725098  1.148736 -1.551525 -0.631786
2013-01-04 -0.988293 -1.328588 -1.071852  0.686866
2013-01-05 -1.284528  2.075510  0.036625  2.124838
2013-01-06  0.860768  0.399680 -0.251398  0.504498

In [11]:
df.head(3)

                   A         B         C         D
2013-01-01  0.510523 -1.035007 -0.740734 -0.392614
2013-01-02 -0.762233  1.403230  0.726063  0.897071
2013-01-03 -0.725098  1.148736 -1.551525 -0.631786

In [12]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.values

array([[ 0.51052268, -1.03500713, -0.74073424, -0.39261411],
       [-0.7622326 ,  1.40322998,  0.72606318,  0.89707109],
       [-0.72509757,  1.14873639, -1.55152461, -0.63178636],
       [-0.98829301, -1.32858826, -1.07185222,  0.68686618],
       [-1.2845278 ,  2.0755095 ,  0.0366248 ,  2.12483836],
       [ 0.86076825,  0.39968036, -0.25139814,  0.5044977 ]])

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.398143  0.443927 -0.475470  0.531479
std    0.869936  1.371867  0.817320  0.990400
min   -1.284528 -1.328588 -1.551525 -0.631786
25%   -0.931778 -0.676335 -0.989073 -0.168336
50%   -0.743665  0.774208 -0.496066  0.595682
75%    0.201618  1.339607 -0.035381  0.844520
max    0.860768  2.075510  0.726063  2.124838

In [17]:
df.sort_values(by='B', ascending=False)
df

                   A         B         C         D
2013-01-01  0.510523 -1.035007 -0.740734 -0.392614
2013-01-02 -0.762233  1.403230  0.726063  0.897071
2013-01-03 -0.725098  1.148736 -1.551525 -0.631786
2013-01-04 -0.988293 -1.328588 -1.071852  0.686866
2013-01-05 -1.284528  2.075510  0.036625  2.124838
2013-01-06  0.860768  0.399680 -0.251398  0.504498

In [18]:
df['A']

2013-01-01    0.510523
2013-01-02   -0.762233
2013-01-03   -0.725098
2013-01-04   -0.988293
2013-01-05   -1.284528
2013-01-06    0.860768
Freq: D, Name: A, dtype: float64

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01  0.510523 -1.035007 -0.740734 -0.392614
2013-01-02 -0.762233  1.403230  0.726063  0.897071
2013-01-03 -0.725098  1.148736 -1.551525 -0.631786

In [20]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.762233  1.403230  0.726063  0.897071
2013-01-03 -0.725098  1.148736 -1.551525 -0.631786
2013-01-04 -0.988293 -1.328588 -1.071852  0.686866

In [21]:
df.loc[dates[0]]

A    0.510523
B   -1.035007
C   -0.740734
D   -0.392614
Name: 2013-01-01 00:00:00, dtype: float64

In [22]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.510523 -1.035007
2013-01-02 -0.762233  1.403230
2013-01-03 -0.725098  1.148736
2013-01-04 -0.988293 -1.328588
2013-01-05 -1.284528  2.075510
2013-01-06  0.860768  0.399680

In [23]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.762233  1.403230
2013-01-03 -0.725098  1.148736
2013-01-04 -0.988293 -1.328588

In [24]:
df.loc['20130102',['A','B']]

A   -0.762233
B    1.403230
Name: 2013-01-02 00:00:00, dtype: float64

In [25]:
df.loc[dates[0], 'A']

0.5105226785680301

In [26]:
df.iloc[3]

A   -0.988293
B   -1.328588
C   -1.071852
D    0.686866
Name: 2013-01-04 00:00:00, dtype: float64

In [27]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.988293 -1.328588
2013-01-05 -1.284528  2.075510

In [28]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.762233  0.726063
2013-01-03 -0.725098 -1.551525
2013-01-05 -1.284528  0.036625

In [29]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.762233  1.403230  0.726063  0.897071
2013-01-03 -0.725098  1.148736 -1.551525 -0.631786

In [30]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.035007 -0.740734
2013-01-02  1.403230  0.726063
2013-01-03  1.148736 -1.551525
2013-01-04 -1.328588 -1.071852
2013-01-05  2.075510  0.036625
2013-01-06  0.399680 -0.251398

In [31]:
df

                   A         B         C         D
2013-01-01  0.510523 -1.035007 -0.740734 -0.392614
2013-01-02 -0.762233  1.403230  0.726063  0.897071
2013-01-03 -0.725098  1.148736 -1.551525 -0.631786
2013-01-04 -0.988293 -1.328588 -1.071852  0.686866
2013-01-05 -1.284528  2.075510  0.036625  2.124838
2013-01-06  0.860768  0.399680 -0.251398  0.504498

In [32]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.510523 -1.035007 -0.740734 -0.392614
2013-01-06  0.860768  0.399680 -0.251398  0.504498

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.510523       NaN       NaN       NaN
2013-01-02       NaN  1.403230  0.726063  0.897071
2013-01-03       NaN  1.148736       NaN       NaN
2013-01-04       NaN       NaN       NaN  0.686866
2013-01-05       NaN  2.075510  0.036625  2.124838
2013-01-06  0.860768  0.399680       NaN  0.504498

In [34]:
df2 = df.copy()

In [35]:
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.510523 -1.035007 -0.740734 -0.392614    one
2013-01-02 -0.762233  1.403230  0.726063  0.897071    one
2013-01-03 -0.725098  1.148736 -1.551525 -0.631786    two
2013-01-04 -0.988293 -1.328588 -1.071852  0.686866  three
2013-01-05 -1.284528  2.075510  0.036625  2.124838   four
2013-01-06  0.860768  0.399680 -0.251398  0.504498  three

In [36]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [37]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.725098  1.148736 -1.551525 -0.631786   two
2013-01-05 -1.284528  2.075510  0.036625  2.124838  four

In [38]:
df

                   A         B         C         D
2013-01-01  0.510523 -1.035007 -0.740734 -0.392614
2013-01-02 -0.762233  1.403230  0.726063  0.897071
2013-01-03 -0.725098  1.148736 -1.551525 -0.631786
2013-01-04 -0.988293 -1.328588 -1.071852  0.686866
2013-01-05 -1.284528  2.075510  0.036625  2.124838
2013-01-06  0.860768  0.399680 -0.251398  0.504498

In [39]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.510523 -1.035007 -0.740734 -0.392614
2013-01-02 -0.251710  0.368223 -0.014671  0.504457
2013-01-03 -0.976807  1.516959 -1.566196 -0.127329
2013-01-04 -1.965100  0.188371 -2.638048  0.559537
2013-01-05 -3.249628  2.263880 -2.601423  2.684375
2013-01-06 -2.388860  2.663561 -2.852821  3.188873

In [40]:
df.apply(lambda x: x.max() - x.min())

A    2.145296
B    3.404098
C    2.277588
D    2.756625
dtype: float64

## pandas 이용해서 CCTV와 인구 현황 데이터 파악하기

In [41]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [42]:
CCTV_Seoul.sort_values(by='소계', ascending=True).head(5)

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  485        238    159     42    386
12  마포구  574        314    118    169    379
17  송파구  618        529     21     68    463
24  중랑구  660        509    121    177    109
23   중구  671        413    190     72    348

In [43]:
CCTV_Seoul.sort_values(by='소계', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  2780       1292    430    584    932
18  양천구  2034       1843    142     30    467
14  서초구  1930       1406    157    336    398
21  은평구  1873       1138    224    278    468
20  용산구  1624       1368    218    112    398

In [44]:
CCTV_Seoul['최근증가율'] = (CCTV_Seoul['2016년'] + CCTV_Seoul['2015년'] + CCTV_Seoul['2014년']) / CCTV_Seoul['2013년도 이전'] * 100
CCTV_Seoul.sort_values(by='최근증가율', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1002        464    314    211    630  248.922414
9   도봉구   485        238    159     42    386  246.638655
12  마포구   574        314    118    169    379  212.101911
8   노원구  1265        542     57    451    516  188.929889
1   강동구   773        379     99    155    377  166.490765

In [45]:
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [46]:
pop_Seoul.drop([0], inplace=True)
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [47]:
pop_Seoul['구별'].unique()

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구', nan],
      dtype=object)

In [48]:
pop_Seoul[pop_Seoul['구별'].isnull()]

     구별  인구수  한국인  외국인  고령자
26  NaN  NaN  NaN  NaN  NaN

In [49]:
pop_Seoul.drop([26], inplace=True)
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [50]:
pop_Seoul['외국인비율'] = pop_Seoul['외국인'] / pop_Seoul['인구수'] * 100
pop_Seoul['고령자비율'] = pop_Seoul['고령자'] / pop_Seoul['인구수'] * 100
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
1  종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2   중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3  용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
4  성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
5  광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849

In [51]:
pop_Seoul.sort_values(by='인구수', ascending=False).head(5)

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
23  강남구  570500.0  565550.0   4950.0  63167.0  0.867660  11.072217
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [52]:
pop_Seoul.sort_values(by='외국인', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
21   관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291
6   동대문구  369496.0  354079.0  15417.0  54173.0  4.172440  14.661322

In [55]:
pop_Seoul.sort_values(by='외국인비율', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427

In [56]:
pop_Seoul.sort_values(by='고령자', ascending=False).head(5)

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
12  은평구  494388.0  489943.0   4445.0  72334.0  0.899091  14.631019
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [57]:
pop_Seoul.sort_values(by='고령자비율', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
9    강북구  330192.0  326686.0   3506.0  54813.0  1.061806  16.600342
1    종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
13  서대문구  327163.0  314982.0  12181.0  48161.0  3.723221  14.720797

## pandas 고급 기능 - 두 DataFrame 병합하기

In [59]:
df1 = pd.DataFrame({'A': ['A0','A1','A2','A3'],
                   'B': ['B0','B1','B2','B3'],
                   'C': ['C0','C1','C2','C3'],
                   'D': ['D0','D1','D2','D3']},
                  index=[0,1,2,3])

df2 = pd.DataFrame({'A': ['A4','A5','A6','A7'],
                   'B': ['B4','B5','B6','B7'],
                   'C': ['C4','C5','C6','C7'],
                   'D': ['D4','D5','D6','D7']},
                  index=[4,5,6,7])

df3 = pd.DataFrame({'A': ['A8','A9','A10','A11'],
                   'B': ['B8','B9','B10','B11'],
                   'C': ['C8','C9','C10','C11'],
                   'D': ['D8','D9','D10','D11']},
                  index=[8,9,10,11])

In [60]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [61]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [62]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [64]:
result = pd.concat([df1,df2,df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [65]:
result = pd.concat([df1,df2,df3], keys=['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [66]:
result.index

MultiIndex(levels=[['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]],
           codes=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

In [67]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [68]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [69]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                  'D': ['D2', 'D3', 'D6', 'D7'],
                  'F': ['F2', 'F3', 'F6', 'F7']},
                 index=[2,3,6,7])

result = pd.concat([df1, df4], axis=1)

In [70]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [71]:
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [72]:
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [73]:
result = pd.concat([df1, df4], axis=1, join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [74]:
result = pd.concat([df1, df4], axis=1, join_axes=[df1.index])
result

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [75]:
result = pd.concat([df1, df4], ignore_index=True)
result

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [83]:
left = pd.DataFrame({'key': ['K0','K4','K2','K3'],
                    'A': ['A0','A1','A2','A3'],
                    'B': ['B0','B1','B2','B3']})

right = pd.DataFrame({'key': ['K0','K1','K2','K3'],
                    'C': ['C0','C1','C2','C3'],
                    'D': ['D0','D1','D2','D3']})

left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [84]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [85]:
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [86]:
pd.merge(left, right, how='left', on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [87]:
pd.merge(left, right, how='right', on='key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K1  NaN  NaN  C1  D1

In [88]:
pd.merge(left, right, how='outer', on='key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

In [90]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

## CCTV 데이터와 인구 현황 데이터를 합치고 분석하기

In [91]:
data_result = pd.merge(CCTV_Seoul, pop_Seoul, on='구별')
data_result.head()

,구별,소계,2013년도 이전,2014년,2015년,2016년,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
0,강남구,2780,1292,430,584,932,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217
1,강동구,773,379,99,155,377,166.490765,453233.0,449019.0,4214.0,54622.0,0.929765,12.051638
2,강북구,748,369,120,138,204,125.203252,330192.0,326686.0,3506.0,54813.0,1.061806,16.600342
3,강서구,884,388,258,184,81,134.793814,603772.0,597248.0,6524.0,72548.0,1.080540,12.015794
4,관악구,1496,846,260,390,613,149.290780,525515.0,507203.0,18312.0,68082.0,3.484582,12.955291

In [92]:
del data_result['2013년도 이전']
del data_result['2014년']
del data_result['2015년']
del data_result['2016년']
data_result.head()

,구별,소계,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
0,강남구,2780,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217
1,강동구,773,166.490765,453233.0,449019.0,4214.0,54622.0,0.929765,12.051638
2,강북구,748,125.203252,330192.0,326686.0,3506.0,54813.0,1.061806,16.600342
3,강서구,884,134.793814,603772.0,597248.0,6524.0,72548.0,1.080540,12.015794
4,관악구,1496,149.290780,525515.0,507203.0,18312.0,68082.0,3.484582,12.955291

In [93]:
data_result.set_index('구별', inplace=True)
data_result.head()

,소계,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
구별,,,,,,,,
강남구,2780,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217
강동구,773,166.490765,453233.0,449019.0,4214.0,54622.0,0.929765,12.051638
강북구,748,125.203252,330192.0,326686.0,3506.0,54813.0,1.061806,16.600342
강서구,884,134.793814,603772.0,597248.0,6524.0,72548.0,1.080540,12.015794
관악구,1496,149.290780,525515.0,507203.0,18312.0,68082.0,3.484582,12.955291

In [94]:
np.corrcoef(data_result['고령자비율'], data_result['소계'])

array([[ 1.        , -0.28078554],
       [-0.28078554,  1.        ]])

In [95]:
np.corrcoef(data_result['외국인비율'], data_result['소계'])

array([[ 1.        , -0.13607433],
       [-0.13607433,  1.        ]])

In [96]:
np.corrcoef(data_result['인구수'], data_result['소계'])

array([[1.        , 0.30634228],
       [0.30634228, 1.        ]])